IDENTIFICATION DIVISION.
PROGRAM-ID. ReadFile.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE ASSIGN TO "saludos.txt"
       ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD INPUT-FILE.
01 INPUT-RECORD PIC X(80).

WORKING-STORAGE SECTION.

PROCEDURE DIVISION.
    OPEN INPUT INPUT-FILE.
    READ INPUT-FILE INTO INPUT-RECORD
        AT END DISPLAY "Fin del archivo." 
        NOT AT END DISPLAY "Contenido: " INPUT-RECORD.
    CLOSE INPUT-FILE.
    STOP RUN.
