IDENTIFICATION DIVISION.
PROGRAM-ID. WriteFile.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT OUTPUT-FILE ASSIGN TO "saludos.txt"
       ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD OUTPUT-FILE.
01 OUTPUT-RECORD PIC X(80).

WORKING-STORAGE SECTION.

PROCEDURE DIVISION.
    OPEN OUTPUT OUTPUT-FILE.
    MOVE "Hola, este es un saludo desde COBOL!" TO OUTPUT-RECORD.
    WRITE OUTPUT-RECORD.
    CLOSE OUTPUT-FILE.
    DISPLAY "Se ha escrito un saludo en 'saludos.txt'".
    STOP RUN.
